ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l211x_l112x/SYSCTL_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="SYSCTL" HW_revision="1.0">
    <register id="SYSCTL_IIDX" width="32" offset="0x1020" description="SYSCTL interrupt index">
        <bitfield id="STAT" description="The SYSCTL interrupt index (IIDX) register generates a value corresponding to the highest priority pending interrupt source.  This value may be used as an address offset for fast, deterministic handling in the interrupt service routine.  A read of the IIDX register will clear the corresponding interrupt status in the RIS and MIS registers." begin="2" end="0" width="3" rwaccess="R">
            <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
            <bitenum id="LFOSCGOOD" value="0x1" description="LFOSCGOOD interrupt pending"/>
            <bitenum id="ANACLKERR" value="0x2" description=""/>
            <bitenum id="FLASHSEC" value="0x3" description=""/>
            <bitenum id="SRAMSEC" value="0x4" description=""/>
            <bitenum id="LFXTGOOD" value="0x5" description=""/>
            <bitenum id="HFCLKGOOD" value="0x6" description=""/>
            <bitenum id="HSCLKGOOD" value="0x7" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_IMASK" width="32" offset="0x1028" description="SYSCTL interrupt mask">
        <bitfield id="LFOSCGOOD" description="Enable or disable the LFOSCGOOD interrupt. LFOSCGOOD indicates that the LFOSC has started successfully." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="HFCLKGOOD" description="HFCLK GOOD" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SRAMSEC" description="SRAM Single Error Correct" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="HSCLKGOOD" description="HSCLK GOOD" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="ANACLKERR" description="Analog Clocking Consistency Error" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FLASHSEC" description="Flash Single Error Correct" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LFXTGOOD" description="LFXT GOOD" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_RIS" width="32" offset="0x1030" description="SYSCTL raw interrupt status">
        <bitfield id="LFOSCGOOD" description="Raw status of the LFOSCGOOD interrupt." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="No interrupt pending"/>
            <bitenum id="TRUE" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="HFCLKGOOD" description="HFCLK GOOD" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SRAMSEC" description="SRAM Single Error Correct" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="HSCLKGOOD" description="HSCLK GOOD" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="ANACLKERR" description="Analog Clocking Consistency Error" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FLASHSEC" description="Flash Single Error Correct" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LFXTGOOD" description="LFXT GOOD" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MIS" width="32" offset="0x1038" description="SYSCTL masked interrupt status">
        <bitfield id="LFOSCGOOD" description="Masked status of the LFOSCGOOD interrupt." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="No interrupt pending"/>
            <bitenum id="TRUE" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="HFCLKGOOD" description="HFCLK GOOD" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SRAMSEC" description="SRAM Single Error Correct" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="HSCLKGOOD" description="HSCLK GOOD" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="ANACLKERR" description="Analog Clocking Consistency Error" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FLASHSEC" description="Flash Single Error Correct" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LFXTGOOD" description="LFXT GOOD" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_ISET" width="32" offset="0x1040" description="SYSCTL interrupt set">
        <bitfield id="LFOSCGOOD" description="Set the LFOSCGOOD interrupt." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0h hs no effect"/>
            <bitenum id="SET" value="0x1" description="Set interrupt"/>
        </bitfield>
        <bitfield id="HFCLKGOOD" description="HFCLK GOOD" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="SET" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SRAMSEC" description="SRAM Single Error Correct" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="SET" value="0x1" description=""/>
        </bitfield>
        <bitfield id="HSCLKGOOD" description="HSCLK GOOD" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="SET" value="0x1" description=""/>
        </bitfield>
        <bitfield id="ANACLKERR" description="Analog Clocking Consistency Error" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="SET" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FLASHSEC" description="Flash Single Error Correct" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="SET" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LFXTGOOD" description="LFXT GOOD" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="SET" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_ICLR" width="32" offset="0x1048" description="SYSCTL interrupt clear">
        <bitfield id="LFOSCGOOD" description="Clear the LFOSCGOOD interrupt." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0h has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
        </bitfield>
        <bitfield id="HFCLKGOOD" description="HFCLK GOOD" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="CLR" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SRAMSEC" description="SRAM Single Error Correct" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="CLR" value="0x1" description=""/>
        </bitfield>
        <bitfield id="HSCLKGOOD" description="HSCLK GOOD" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="CLR" value="0x1" description=""/>
        </bitfield>
        <bitfield id="ANACLKERR" description="Analog Clocking Consistency Error" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="CLR" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FLASHSEC" description="Flash Single Error Correct" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="CLR" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LFXTGOOD" description="LFXT GOOD" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="CLR" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_NMIIIDX" width="32" offset="0x1050" description="NMI interrupt index">
        <bitfield id="STAT" description="The NMI interrupt index (NMIIIDX) register generates a value corresponding to the highest priority pending NMI source.  This value may be used as an address offset for fast, deterministic handling in the NMI service routine.  A read of the NMIIIDX register will clear the corresponding interrupt status in the NMIRIS register." begin="2" end="0" width="3" rwaccess="R">
            <bitenum id="NO_INTR" value="0x0" description="No NMI pending"/>
            <bitenum id="BORLVL" value="0x1" description="BOR Threshold NMI pending"/>
            <bitenum id="WWDT0" value="0x2" description=""/>
            <bitenum id="LFCLKFAIL" value="0x3" description=""/>
            <bitenum id="FLASHDED" value="0x4" description=""/>
            <bitenum id="SRAMDED" value="0x5" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_NMIRIS" width="32" offset="0x1060" description="NMI raw interrupt status">
        <bitfield id="SRAMDED" description="SRAM Double Error Detect" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BORLVL" description="Raw status of the BORLVL NMI" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="No interrupt pending"/>
            <bitenum id="TRUE" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="FLASHDED" description="Flash Double Error Detect" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="WWDT0" description="Watch Dog 0 Fault" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LFCLKFAIL" description="LFXT-EXLF Monitor Fail" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
    </register>
